Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་རི་རབ་མཚུངས་ལ་ཕྱག་འཚལ་ལོ། །
en: Blessed One who is like Mount Sumeru, we prostrate to you!

source: མི་ཡི་དམ་པ་བཟོད་པའི་ཕ་རོལ་ཕྱིན། །
en: “Sublime human, you have perfected patience, And

source: སྐུ་རྣམས་ཀུན་ལ་ནོངས་པ་བགྱིས་ཀྱང་བཟོད། །
en: you accepted all the harm that was done to your bodies in the past.

source: ཡང་འབྱུང་བ་དང་སྐྱེ་དང་འཆི་བས་དཔའ། །
en: You are a hero who has overcome further lives, birth, and death;

source: བཟོད་གསུང་བཅོམ་ལྡན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Blessed One who preaches patience, we prostrate to you!

source: མཐུ་བརྙེས་བདེ་བར་གཤེགས་པ་མི་གཡོ་བ། །གནས་དང་གནས་མིན་མཁས་པ་བསྙེངས་མི་མངའ། །
en: “Blissful One, your power and attainment are unwavering, You are an expert in distinguishing the correct from the incorrect, you are fearless, And

source: ཁྱོད་ཀྱིས་སེམས་ཅན་མང་པོ་བྱང་ཆུབ་བཀོད། །
en: you have established many beings in the state of awakening;

source: ཆོས་གནས་རྒྱལ་བ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Victorious One who dwells in the Dharma, we prostrate to you!

source: འདུས་བགྱིས་ཉམ་ཆུང་སྙིང་པོ་མེད་པར་མཁྱེན། །སྐྱེ་བའི་ཚོགས་ནི་ཉུང་བ་མ་ལགས་སེལ། །
en: “You know that conditioned phenomena are feeble and lack substance, And that everything that arises disappears before long.

source: ཁྱོད་ཀྱི་མཁྱེན་པ་སྲིད་གསུམ་ཁྱད་པར་འཕགས། །ཡེ་ཤེས་ཕ་རོལ་ཕྱིན་ལ་ཕྱག་འཚལ་ལོ། །
en: Your insight is more exalted than anything in the three worlds And you have perfected wisdom; we prostrate to you!

source: སེམས་ཅན་ལོང་བ་སྡུག་བསྔལ་མགོན་མེད་པ། །དེ་དག་ཁྱོད་ཀྱིས་དཀོན་མཆོག་གསུམ་ཚིམ་བགྱིས། །
en: “Through the Three Jewels, you bring satisfaction To beings who are blind, afflicted, and defenseless, And

source: ཁྱོད་ནི་བདུད་དཔུང་བཅས་པ་སྐྲག་མཛད་པ། །བཅོམ་ལྡན་མགོན་གྱུར་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: you scare away Māra and his armies; Blessed One, protector, we prostrate to you!

source: སྟོབས་དང་བསམ་གཏན་དང་ནི་དབང་པོ་བསྒོམས། །
en: “You have cultivated the powers, the concentrations, and the strengths, And

source: ཁྱོད་ཀྱིས་བདུད་ནི་དཔུང་དང་བཅས་པ་བཅོམ། །
en: you have defeated Māra and his armies.

source: སྲིད་པ་རྣམས་ཀྱི་ནང་ན་མཆོག་གྱུར་པ། །ཐུབ་པ་དབང་པོ་བསྒོམས་ལ་ཕྱག་འཚལ་ལོ། །
en: You have cultivated the strengths and are foremost within all existence; Sage, we prostrate to you!

source: དད་པའི་རྩ་བ་རྒྱ་ཆེན་ཆོས་བསྟན་པ། །མཚུངས་མེད་བྱང་ཆུབ་ལ་ནི་ཆགས་མི་མངའ། །
en: “You reveal the roots of faith and the extensive Dharma, You are free from attachment to unequaled awakening, And

source: གྲིབ་མ་ལྟ་བུར་མཁྱེན་ནས་བདེ་གསུངས་པ། །བཅོམ་ལྡན་གདུགས་འདྲ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: you speak of happiness, knowing it to be like a shadow; Blessed One who is like a parasol, we prostrate to you!

source: འཕགས་པའི་འཁོར་ལོ་རྨི་འདྲ་རབ་ཏུ་བསྐོར། །
en: You turn the dreamlike noble wheel.

source: འདུས་བགྱིས་ཡང་དག་ཏུ་ནི་རྨི་ལམ་འདྲར། །མཁྱེན་ནས་སེམས་ཅན་མང་པོ་དྲན་པར་མཛད། །
en: Understanding conditioned things to be truly like dreams, You remind a multitude of beings.

source: ཁྱོད་ཀྱི་ལྗགས་མཆོག་དག་པ་དྲི་མི་མངའ། །
en: “Your supreme tongue is pure and stainless.

source: ལྗགས་ཀྱིས་རང་གི་ཞལ་གྱི་དཀྱིལ་འཁོར་ཁེབས། །ལྗགས་ནི་པད་མ་འདབ་མ་བརྒྱ་ལྟ་བུ། །ལྗགས་སྐྱོན་མི་མངའ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: With your tongue you can cover your face— It is like a lotus with a hundred petals; We prostrate to you whose tongue is immaculate!

source: སྲིད་གསུམ་ཀུན་ལ་ཆགས་པ་མི་མངའ་བ། །འགྲོ་བ་རྣམས་ལ་འདོད་པའི་སྐྱོན་མི་གསུང་། །
en: “You are not attached to any of the three worlds, You do not teach beings through the defect of desire,

source: འདོད་པའི་ཆགས་བྲལ་སྨད་པ་མ་ལགས་པ། །བྱང་ཆུབ་མཆོག་ལ་སྲོག་ཆགས་མོས་པར་མཛད། །
en: You are free from attachment and slander, And you encourage beings to devote themselves to supreme awakening.

source: ཉོན་མོངས་དགྲ་དང་སྡིག་པའི་དགྲ་སྤངས་པ། །སེར་སྣའི་འདོད་ཆགས་བྲལ་ཞིང་ཆགས་མི་མངའ། །
en: “You have defeated the enemies: afflictions and negative deeds. You are dispassionate, and free from attachment and stinginess.

source: མི་ཡི་དམ་པ་གསེར་ལྟར་དཔལ་སྟུག་པ། །ཁྱོད་ཀྱི་མཚན་དང་གྲགས་པ་ཆུབ་པར་གྲགས། །
en: Sublime human, you shine like gold, And your name and fame resound everywhere.

source: གནས་དང་དབང་པོ་རྣམ་པར་འབྱེད་ལ་མཁས། །འདི་ན་བཞུགས་ཤིང་འགྲོ་བའི་མིག་ཏུ་གྱུར། །
en: “Expert in the discernment of realms and faculties, You are the eyes of beings as you reside in this world.

source: གནས་དང་ཡིག་འབྲུ་ཚིག་གི་དོན་བསླབས་པས། །ཁྱོད་ཀྱིས་ཆུ་བོ་བཞི་ལ་ཟམ་པ་བཏགས། །
en: Trained as you are in the sciences, letters, and semantics, You manifest a bridge to cross the four rivers.

source: གླང་པོ་རིན་ཐང་མ་མཆིས་སྦྱིན་པ་མཛད། །
en: “You who offered the gift of a priceless elephant,

source: འདྲེན་པ་མི་དང་ལྷ་རྣམས་སྒྲོལ་བ་པོ། །ཁྱོད་ཀྱི་ཡོན་ཏན་མཐའ་མ་མི་རྙེད་དེ། །
en: Great leader, liberator of humans and gods, Your qualities are infinite;

source: མགོན་པོ་ཁྱོད་ལ་བདག་ནི་ཐལ་མོ་སྦྱར། །
en: Protector, we join our hands toward you.

source: མི་ཡི་མཆོག་ལ་རྡུལ་ནི་སྦྱིན་བྱིན་པས། །མི་མཇེད་འཛམ་བུའི་རྒྱལ་པོར་གྱུར་ལགས་ན། །འདིར་ནི་དབང་པོ་དང་བས་ཐལ་སྦྱར་ནས། །སྐྱབས་སུ་ཉེ་བར་མཆི་བ་སྨོས་ཅི་འཚལ། །
en: “If offering a speck of dust to the foremost among humans Causes one to become a king over Jambudvīpa in the Sahā world, What need is there to mention going for refuge By joining one’s hands with a mind filled with faith?

source: ཕུང་པོ་གསོག་སྟེ་ཉམ་ཆུང་སྙིང་པོ་མེད། །སྟོང་པ་སྒྱུ་མ་ཆུ་ཟླ་འདྲ་བར་ནི། །གཽ་ཏམ་ཁྱོད་ཀྱིས་དེ་དག་ཡང་དག་མཁྱེན། །
en: “The aggregates are empty, feeble, and insubstantial— They are empty, like illusions or reflections of the moon in water. Gautama, you know their true nature;

source: ཕུང་པོ་ཁམས་མཁས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Expert in the aggregates and the elements, we prostrate to you!

source: སྲེད་པའི་སྲད་བུས་དམ་དུ་མདུད་བོར་ཏེ། །སྲིད་པའི་འགྲོ་བར་དྲ་བར་རབ་གྲགས་པ། །སྲིད་པར་འགྲོ་བ་རྣམས་ཀྱི་དྲ་བ་དེ། །བདེ་གཤེགས་ཁྱོད་ཀྱི་མཁྱེན་པའི་འོད་ཀྱིས་དྲལ། །
en: “You have untied the tight knot in the rope of craving, Which is known as the web of existence. The web that binds beings to existence— Blissful One, the light of your wisdom tears it apart.

source: ཚངས་པའི་སྒྲ་སྐད་ལྟ་བུའི་གསུང་བརྗོད་པ། །ཤོ་བེ་མ་ལགས་མི་འགྱུར་འདྲིད་མ་ལགས། །
en: “Your speech is like the voice of Brahmā— It is free from falsehood, immutable, and undeceiving.

source: ཕུན་ཚོགས་གསུང་དེ་དེ་དག་ཐོས་ནས་ནི། །ཐལ་མོ་སྦྱར་ཏེ་སྐྱབས་སུ་ཉེ་བར་མཆི། །
en: As we hear your perfect speech, We join our hands and go for refuge in you.

source: ཕྱག་གི་མཐིལ་གྱིས་ས་འདིར་རེག་པ་ན། །ནགས་ཚལ་བཅས་པར་རྣམ་པ་དྲུག་གཡོས་ཀྱང་། །འདིར་ནི་གཞན་ལ་གནོད་པར་འགྱུར་མ་མཆིས། །
en: “When you touched this earth with the palm of your hand, The earth and its forests shook in six ways, Yet no one was hurt in this process.

source: བདུད་ཕྱོགས་དགྲ་བཅོམ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: You who conquer the enemy, Māra’s hordes; we prostrate to you!

source: ལྷ་ཡི་རྒྱལ་པོ་ཆེ་དང་མཁས་པ་གང་། །ཁྱོད་ཀྱི་ཆོས་དོན་གཉེར་ཞིང་མཆིས་པ་རྣམས། །དེ་དག་སོ་སོར་ཆོས་བསྟན་ཐོས་ནས་སུ། །ཞབས་གཉིས་ལ་ནི་རབ་ཏུ་གཏུགས་པར་བགྱིད། །
en: “Great king of the gods, Wise One, When those who pursue your Dharma Hear your Dharma teachings, They bow down at your feet!”

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོའི་སླས་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After the queens of the kiṃnara king had praised the Blessed One with these verses, they supplicated him:

source: བཅོམ་ལྡན་འདས་བདག་ཅག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་ནས་
en: “Blessed One, we are pursuing unsurpassed and perfect awakening,

source: བུད་མེད་ཀྱི་དངོས་པོས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་ན
en: but we are unable to awaken to unsurpassed and perfect buddhahood with our female bodies.

source: ཇི་ལྟར་བདག་ཅག་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ། སྐྱེས་པའི་དངོས་པོ་འཐོབ་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་དེ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཅག་ལ་ལེགས་པར་བཤད་དུ་གསོལ།
en: Blessed One, please tell us about the qualities that will enable us to leave behind these female bodies, acquire male bodies, and awaken to unsurpassed and perfect buddhahood!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་སླས་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: replied the Blessed One,

source: སྲིང་མོ་དག་དེའི་ཕྱིར་ཤིན་ཏུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: “Sisters,” “listen carefully and pay attention.

source: ཇི་ལྟར་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་འཐོབ་ཅིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ངས་ཁྱོད་ལ་བཤད་པར་བྱའོ། །
en: I shall now explain to you how to leave behind your female bodies, acquire male bodies, and swiftly awaken to unsurpassed and perfect buddhahood.”

source: མི་འམ་ཅིའི་རྒྱལ་པོའི་སླས་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་གསོལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The queens of the kiṃnara king agreed to this and listened as the Blessed One had directed. The Blessed One then said,

source: སྲིང་མོ་དག་ཆོས་གཅིག་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་ཅིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ
en: “Sisters, if women possess this one quality, they will leave behind their female bodies, acquire male bodies, and swiftly awaken to unsurpassed and perfect buddhahood.

source: ཆོས་གཅིག་པོ་དེ་གང་ཞེ་ན།
en: What is this one quality?

source: འདི་ལྟ་སྟེ། ལྷག་པའི་བསམ་པས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་སེམས་བསྐྱེད་པ་དང་། མི་མཉམ་པ་དང་མཉམ་པའི་སེམས་བསྐྱེད་པ་དང་། འཇིག་རྟེན་གསུམ་ལས་ཁྱད་པར་དུ་འཕགས་པའི་སེམས་བསྐྱེད་པ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་བརྗེད་པ་མེད་པའི་སེམས་བསྐྱེད་པ་སྟེ།
en: It is giving rise to the mind set on awakening with good motivation, giving rise to the mind set on omniscience, giving rise to the unequaled attitude, giving rise to the attitude that is more exalted than anything in the three worlds, giving rise to the attitude that does not forget all the roots of virtue.

source: སྲིང་མོ་དག་ཆོས་གཅིག་པོ་འདི་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་ལུས་ཐོབ་པར་འགྱུར་རོ། །
en: Sisters, if women possess this one quality, they will leave behind their female bodies and acquire male bodies.

source: སྲིང་མོ་དག་གཞན་ཡང་ཆོས་གཉིས་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་ལུས་ཐོབ་པར་འགྱུར་རོ། །
en: “Furthermore, sisters, if women possess two qualities, they will leave behind their female bodies and acquire male bodies.

source: གཉིས་གང་ཞེ་ན།
en: What are those two qualities?

source: ཕྲག་དོག་མེད་པ་དང་། སེར་སྣ་མེད་པ་སྟེ།
en: They are (1) the absence of envy and (2) the absence of stinginess.

source: སྲིང་མོ་དག་ཆོས་འདི་གཉིས་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: Sisters, if women possess those two qualities, they will leave behind their female bodies and acquire male bodies.

source: སྲིང་མོ་དག་གཞན་ཡང་ཆོས་གསུམ་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: “Furthermore, sisters, if women possess three qualities, they will leave behind their female bodies and acquire male bodies.

source: གསུམ་གང་ཞེ་ན།
en: What are those three qualities?

source: ལུས་ཀྱི་སྡོམ་པ་གསུམ་ཡོངས་སུ་དག་པ་དང་། ངག་གི་སྡོམ་པ་བཞི་ཡོངས་སུ་དག་པ་དང་། ཡིད་ཀྱི་སྡོམ་པ་གསུམ་ཡོངས་སུ་དག་པ་སྟེ།
en: They are (1) the purity of the three commitments related to the body, (2) the purity of the four commitments related to speech, and (3) the purity of the three commitments related to the mind.

source: སྲིང་མོ་དག་ཆོས་གསུམ་པོ་འདི་དག་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: Sisters, if women possess those three qualities, they will leave behind their female bodies and acquire male bodies.

source: སྲིང་མོ་དག་གཞན་ཡང་ཆོས་བཞི་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: “Furthermore, sisters, if women possess four qualities, they will leave behind their female bodies and acquire male bodies.

source: གཡོ་མེད་པར་སྦྱིན་པ་སྦྱིན་པ་དང་། གཡོ་མེད་པར་བསླབ་པའི་གནས་འཛིན་པ་དང་། གཡོ་མེད་པར་ཚུལ་ཁྲིམས་སྟེན་པ་དང་། གཡོ་མེད་པར་ཆོས་ཉན་པ་སྟེ།
en: They are (1) practicing generosity without hypocrisy, (2) upholding the precepts without hypocrisy, (3) adhering to one’s discipline without hypocrisy, and (4) listening to the Dharma without hypocrisy.

source: སྲིང་མོ་དག་ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: Sisters, if women possess those four qualities, they will leave behind their female bodies and acquire male bodies.

source: སྲིང་མོ་དག་གཞན་ཡང་ཆོས་ལྔ་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: “Furthermore, sisters, if women possess five qualities, they will leave behind their female bodies and acquire male bodies.

source: ལྔ་གང་ཞེ་ན།
en: What are those five qualities?

source: ཆོས་དོན་དུ་གཉེར་བ་དང་། ཆོས་ཐོས་ནས་ཚུལ་བཞིན་དུ་སོ་སོར་རྟོག་པ་དང་། བསམ་པ་ཐག་པ་ནས་བུད་མེད་ཀྱི་དངོས་པོ་ལ་སྨོད་པ་དང་། རྟག་པར་རྒྱུན་དུ་སྐྱེས་པའི་ལུས་འཐོབ་པར་སེམས་སྐྱེད་པ་དང་། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པ་སྟེ།
en: They are (1) striving for the Dharma, (2) considering the Dharma correctly upon hearing it, (3) wholeheartedly loathing the female body, (4) continuously forming the wish to attain a male body, and (5) acting in accordance with one’s words.

source: སྲིང་མོ་དག་ཆོས་ལྔ་པོ་འདི་དག་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: Sisters, if women possess those five qualities, they will leave behind their female bodies and acquire male bodies.

source: སྲིང་མོ་དག་གཞན་ཡང་ཆོས་དྲུག་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ། སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: “Furthermore, sisters, if women possess six qualities, they will leave behind their female bodies and acquire male bodies.

source: དྲུག་གང་ཞེ་ན།
en: What are those six qualities?

source: དྲང་བ་དང་། མཉེན་པ་དང་། སྒྱུ་མེད་པ་དང་། གཡོ་མེད་པ་དང་། བསྩལ་བ་མེད་པ་དང་། བཅོས་པ་མེད་པ་སྟེ།
en: They are (1) sincerity, (2) gentleness, (3) integrity, (4) honesty, (5) uprightness, and (6) genuineness.

source: སྲིང་མོ་དག་ཆོས་དྲུག་པོ་འདི་དག་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: Sisters, if women possess those six qualities, they will leave behind their female bodies and acquire male bodies.

source: སྲིང་མོ་དག་གཞན་ཡང་ཆོས་བདུན་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: “Furthermore, sisters, if women possess seven qualities, they will leave behind their female bodies and acquire male bodies.

source: བདུན་གང་ཞེ་ན།
en: What are those seven qualities?

source: སངས་རྒྱས་ཀྱི་སྐུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་རྗེས་སུ་དྲན་པ་དང་། རང་གིས་ཕྱིར་མི་ལྡོག་པའི་དགེ་འདུན་བསྡུ་བའི་ཕྱིར་དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། སྨོན་ལམ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཡོངས་སུ་དོར་བའི་ཕྱིར་གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་ལྷ་རྗེས་སུ་དྲན་པ་དང་། དེ་དག་དགྲོལ་བའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་པ་སྟེ།
en: They are (1) recollecting the Buddha in order to achieve the body of a buddha, (2) recollecting the Dharma in order to receive the Dharma of the buddhas, (3) recollecting the Saṅgha in order to gather an irreversible saṅgha, (4) recollecting discipline in order to purify aspiration prayers, (5) recollecting generosity in order to abandon all afflictions, (6) recollecting the gods in order to purify the mind set on awakening, and (7) focusing on all beings in order to liberate them.

source: སྲིང་མོ་དག་ཆོས་བདུན་པོ་འདི་དག་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: Sisters, if women possess those seven qualities, they will leave behind their female bodies and acquire male bodies.

source: སྲིང་མོ་དག་གཞན་ཡང་ཆོས་བརྒྱད་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: “Furthermore, sisters, if women possess eight qualities, they will leave behind their female bodies and acquire male bodies.

source: བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are those eight qualities?

source: ཟས་ལ་སྲེད་པ་མ་ཡིན་པ་དང་། སྐོམ་ལ་སྲེད་པ་མ་ཡིན་པ་དང་། མེ་ཏོག་དང་། སྤོས་དང་ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་ལ་སྲེད་པ་མ་ཡིན་པ་དང་། སྐྱེད་མོས་ཚལ་དུ་འགྲོ་བར་སྲེད་པ་མ་ཡིན་པ་དང་། རྒོད་པ་དང་འཇོ་བ་ལ་སྲེད་པ་མ་ཡིན་པ་དང་། གླུ་དང་གར་དང་རོལ་མོའི་དབྱངས་སྒྲ་ལ་སྲེད་པ་མ་ཡིན་པ་དང་། དགའ་བ་དང་རྩེ་བ་ལ་སྲེད་པ་མ་ཡིན་པ་དང་། རྣ་བ་དང་། སྒྲ་དང་། སྣ་དང་། དྲི་དང་། ལྕེ་དང་། རོ་དང་། ལུས་དང་། རེག་ལ་དགའ་བ་ལ་སྲེད་པ་མ་ཡིན་པ་སྟེ།
en: They are (1) not craving food, (2) not craving beverages, (3) not craving flowers, perfumes, garlands, ointments, and powders, (4) not craving walks in parks, (5) not craving frivolity and romance, (6) not craving songs, dance, and music, (7) not craving pleasures and games, and (8) not craving the pleasures associated with the ear and sound, nose and smell, tongue and taste, and body and tactile objects.

source: སྲིང་མོ་དག་ཆོས་བརྒྱད་པོ་འདི་དག་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: Sisters, if women possess those eight qualities, they will leave behind their female bodies and acquire male bodies.

source: སྲིང་མོ་དག་གཞན་ཡང་ཆོས་དགུ་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: “Furthermore, sisters, if women possess nine qualities, they will leave behind their female bodies and acquire male bodies.

source: དགུ་གང་ཞེ་ན།
en: What are those nine qualities?

source: ཆད་པར་ལྟ་བ་མ་ཡིན་པ་དང་། རྟག་པར་ལྟ་བ་མ་ཡིན་པ་དང་། བདག་ཏུ་སྨྲ་བ་མ་ཡིན་པ་དང་། སེམས་ཅན་དུ་སྨྲ་བ་མ་ཡིན་པ་དང་། སྲོག་ཏུ་སྨྲ་བ་མ་ཡིན་པ་དང་། གང་ཟག་ཏུ་སྨྲ་བ་མ་ཡིན་པ་དང་། འབྱུང་བར་ལྟ་བ་མ་ཡིན་པ་དང་། འཇིག་པར་ལྟ་བ་མ་ཡིན་པ་དང་། རྒྱུ་དང་རྐྱེན་ལ་འཇུག་པ་ལ་མཁས་པ་ཡིན་ཏེ
en: They are (1) not holding a nihilist view, (2) not holding an eternalist view, (3) not propounding the view of a self, (4) not propounding the view of a sentient being, (5) not propounding the view of a life principle, (6) not propounding the view of a person, (7) not adhering to the view of arising, (8) not adhering to the view of disintegration, and (9) being skilled in engaging with causes and conditions.

source: སྲིང་མོ་དག་ཆོས་དགུ་པོ་འདི་དག་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: Sisters, if women possess those nine qualities, they will leave behind their female bodies and acquire male bodies.

source: སྲིང་མོ་དག་གཞན་ཡང་ཆོས་བཅུ་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: “Furthermore, sisters, if women possess ten qualities, they will leave behind their female bodies and acquire male bodies.

source: བཅུ་གང་ཞེ་ན།
en: What are those ten qualities?

source: སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པར་གནས་པ་དང་། གཞན་གྱི་ལོངས་སྤྱོད་ལ་བརྣབ་སེམས་མི་སྐྱེད་པ་དང་། སྐྱེས་པའི་སེམས་སུ་ཡིད་ལ་བྱེད་པ་སྐྱེད་པ་དང་། སྲོག་གི་ཕྱིར་ཡང་རྫུན་གྱི་ཚིག་མི་སྨྲ་བ་དང་། ཕྲ་མའི་ཚིག་མི་སྨྲ་བ་དང་། ཞེ་གཅོད་པའི་ཚིག་མི་སྨྲ་བ་དང་། ཚིག་ཀྱལ་པ་མི་སྨྲ་བ་དང་། ཕ་རོལ་པོ་དགའ་ཞིང་རྩེ་བ་ལ་ཕྲག་དོག་མེད་པ་དང་། གནོད་སེམས་ཀྱི་བག་ལ་ཉལ་མངོན་པར་སྒྲུབ་པ་དང་། ཡང་དག་པར་ལྟ་བ་དང་ལྡན་པར་འགྱུར་བ་དང་རྣམ་པར་སྨིན་པ་ལ་རེ་བ་མེད་པ་སྟེ།
en: They are (1) abiding with love for all sentient beings, (2) not coveting others’ possessions, (3) thinking in the same way as men, (4) not lying even at the cost of their lives, (5) not pronouncing slanderous words, (6) not using harsh words, (7) not engaging in idle conversations, (8) not being envious of others’ pleasures and games, (9) not arousing the latent tendencies of ill will, and (10) adhering to the right view without hoping for any ripening effect.

source: སྲིང་མོ་དག་ཆོས་བཅུ་པོ་འདི་དག་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: Sisters, if women possess those ten qualities, they will leave behind their female bodies and acquire male bodies.

source: སྲིང་མོ་དག་གཞན་ཡང་བུད་མེད་ཟབ་མོ་ལ་མོས་པ་ཡིན་ཏེ། དེ་གཟུགས་ལ་དབུ་བ་རྡོས་པ་ལྟ་བུར་སོ་སོར་རྟོག་ཀྱང་གཟུགས་ཀྱིས་རྒྱགས་ཤིང་མྱོས་པར་མི་འགྱུར་བ་དང་།
en: “Furthermore, sisters, women should be devoted to the profound by considering forms to be like foam, and not becoming excited or maddened by them.

source: ཚོར་བ་ལ་ཆུའི་ཆུ་བུར་ལྟ་བུར་སོ་སོར་རྟོག་ཀྱང་བདེ་བའི་ཚོར་བ་ལ་རྗེས་སུ་ཆགས་པ་མེད་པ་དང་། སྡུག་བསྔལ་གྱི་ཚོར་བ་ལ་ཁོང་ཁྲོ་བར་མི་འགྱུར་བ་དང་། བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བའི་ཀུན་ཏུ་གཏི་མུག་པར་མི་འགྱུར་བ་དང་།
en: They should consider feelings to be like water bubbles, and not give rise to attachment toward pleasant feelings, aversion toward unpleasant feelings, or ignorance toward feelings that are neither pleasant nor unpleasant.

source: འདུ་ཤེས་ལ་སྨིག་རྒྱུ་ལྟ་བུར་སོ་སོར་རྟོག་ཅིང་བུད་མེད་ཀྱི་འདུ་ཤེས་མི་སྐྱེད། སྐྱེས་པའི་འདུ་ཤེས་མི་སྐྱེད་པ་དང་།
en: They should consider perceptions to be like mirages and not entertain any notions of women and men.

source: འདུ་བྱེད་རྣམས་ལ་ཆུ་ཤིང་གི་ཕུང་པོ་ལྟ་བུར་སོ་སོར་རྟོག་སྟེ། འདུ་བྱེད་ཐམས་ཅད་ལ་སྙིང་པོ་མེད་པར་རྟོགས་ནས་འདུ་བྱེད་ཐམས་ཅད་ལ་མི་གནས་ཤིང་དེ་ལ་ཆགས་པ་མི་སྐྱེད་པ་དང་།
en: They should consider formations to be like plantain trees and, realizing that they all lack substance, not fixate upon them or become attached to any of them.

source: རྣམ་པར་ཤེས་པ་ལ་སྒྱུ་མ་ལྟ་བུར་སོ་སོར་རྟོག་སྟེ། སེམས་དང་ཡིད་དང་རྣམ་པར་རིག་པ་དེ་སྒྱུ་མ་བྱས་པ་བཞིན་དུ་རྟོགས་ནས་ཆོས་ཐམས་ཅད་ལ་ཆགས་པ་མེད་ཞེ་སྡང་མེད་གཏི་མུག་མེད་པ་དང་།
en: They should consider consciousness to be illusory and, realizing that the mind, the mental faculty, and awareness are like illusory displays, not develop attachment, anger, or ignorance in relation to any phenomenon.

source: ལུས་ལ་འབྱུང་བ་ཆེན་པོ་བཞི་དང་ལྡན་པར་སོ་སོར་རྟོག་སྟེའདི་ལྟ་སྟེ། སའི་ཁམས་དང་ལྡན་པ་དང་། ཆུའི་ཁམས་དང་ལྡན་པ་དང་། མེའི་ཁམས་དང་ལྡན་པ་དང་། རླུང་གི་ཁམས་དང་ལྡན་པར་ལུས་ལ་སོ་སོར་རྟོག་གོ། །
en: They should consider that the body is made of the four great elements —earth, water, fire, and wind.

source: ལུས་འདི་ནི་བསྡུས་པ་རྩྭ་དང་། ཤིང་དང་། བོང་བ་དང་། རྩིག་པ་དང་། མིག་ཡོར་ལྟ་བུ་སྟེ།
en: The body is a collection of parts, just like grass, trees, clods of earth, walls, or optical illusions, and

source: འདི་བདག་མ་ཡིན། སེམས་ཅན་མ་ཡིན། སྲོག་མ་ཡིན། སྐྱེས་བུ་མ་ཡིན། གང་ཟག་མ་ཡིན་གྱི་ཕྱིན་ཅི་ལོག་སྔོན་དུ་སོང་བས་རྒྱུ་དང་བྱ་བ་དང་། ལས་ཀྱི་བྱུང་བའོ། །
en: it is therefore devoid of a self, a sentient being, a life principle, an individual, and a person. Rather, the body manifests through causes, deeds, and actions, as guided by delusion.

source: གཞན་ཡང་བུད་མེད་མིག་ལ་ཁ་ཟས་ལས་སྐྱེས་པ་ཤའི་གོང་བུ་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་རང་བཞིན་གྱིས་དབེན་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོག་པ་དང་། དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ལ་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་དང་། རང་བཞིན་གྱིས་དབེན་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོག་པའོ། །
en: Furthermore, women should correctly contemplate how the eyes are balls of flesh produced by the ingestion of food, and that they are essentially empty and naturally detached. In the same way, they should correctly perceive that the ears, the nose, the tongue, the body, and the mental faculty are essentially empty and naturally detached.

source: གཞན་ཡང་བུད་མེད་ལུས་ལ་གཟུགས་བརྙན་ལྟ་བུར་འཇུག་པ་དང་། ངག་ལ་བྲག་ཅ་ལྟ་བུར་འཇུག་པ་དང་། སེམས་ལ་སྒྱུ་མ་ལྟ་བུར་འཇུག་པའོ། །
en: Women should also relate to the body as they would to a reflection, to speech as they would to an echo, and to the mind as they would to an illusion.

source: སྲིང་མོ་དག་ཆོས་འདི་དག་དང་ལྡན་ན་བུད་མེད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་ཐོབ་ཅིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: Sisters, if women possess those qualities, they will leave behind their female bodies, acquire male bodies, and swiftly awaken to unsurpassed and perfect buddhahood.”

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་སླས་དེ་དག་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་ལས་བུད་མེད་ཀྱི་དངོས་པོ་ལས་སྒྱུར་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་ཚིམ་ཞིང་མགུ་སྟེ།
en: When they heard this Dharma teaching from the Blessed One, describing how to leave behind their female bodies, all the queens of the kiṃnara king became satisfied, cheerful, thrilled, and elated.
